create table employees
(id int primary key,
name varchar,
hire_date date,
salary int,
branch varchar
);

INSERT INTO employees (id, name, hire_date, salary, branch)
VALUES
(1, 'Полищук Константин','1988-3-19', 30836, 'Читальный зал'),
(2, 'Бондаренко Татьяна','1970-9-19', 17681, 'Бухгалтерия'),
(3, 'Костюк Михаил','1977-9-28', 28477, 'Редакция'),
(4, 'Шаповал Юлия','2010-3-1', 20261, 'Редакция'),
(5, 'Кузьменко Анна','2008-2-24', 51314, 'Редакция'),
(6, 'Горбатюк Михаил','1978-9-23', 25408, 'Редакция'),
(7, 'Онищенко Павел','1971-3-20', 46198, 'Организация'),
(8, 'Шаповал Виктор','1988-4-23', 38314, 'Читальный зал'),
(9, 'Семенчук Лидия','1978-10-3', 21245, 'Организация'),
(10, 'Гаврилюк Роман','2010-9-28', 18213, 'Читальный зал'),
(11, 'Кравченко Сергей','1972-9-28', 36428, 'Бухгалтерия'),
(12, 'Лисенко Мария','2022-9-9', 59901, 'Читальный зал'),
(13, 'Семенчук Михаил','2017-12-17', 55774, 'Читальный зал'),
(14, 'Панасюк Лидия','1995-7-10', 56472, 'Редакция'),
(15, 'Зозуля Андрей','2012-4-22', 20654, 'Редакция'),
(16, 'Костюк Иван','1977-10-10', 19531, 'Бухгалтерия'),
(17, 'Киричук Георгий','1995-11-24', 36781, 'Читальный зал'),
(18, 'Бондарчук Алина','2011-3-15', 25164, 'Бухгалтерия'),
(19, 'Семенчук Иван','1998-1-16', 24586, 'Бухгалтерия'),
(20, 'Кузьменко София','2005-9-13', 15605, 'Бухгалтерия'),
(21, 'Горбатюк Степан','1978-3-10', 19645, 'Редакция'),
(22, 'Киричук Андрей','1990-11-9', 44557, 'Читальный зал'),
(23, 'Мельниченко Олег','1996-12-21', 15043, 'Бухгалтерия'),
(24, 'Гриценко Ирина','2009-11-7', 37947, 'Читальный зал'),
(25, 'Шевчук Николай','2001-8-14', 45126, 'Организация'),
(26, 'Левченко Дмитрий','2024-2-4', 56402, 'Организация'),
(27, 'Сердюк Вероника','2007-9-24', 36423, 'Бухгалтерия'),
(28, 'Онищенко Мария','1977-8-27', 55742, 'Редакция'),
(29, 'Ткачук Егор','1987-9-24', 40534, 'Организация'),
(30, 'Зозуля София','1979-4-18', 24004, 'Читальный зал'),
(31, 'Левченко Максим','1971-10-1', 27236, 'Организация'),
(32, 'Семенчук Алексей','2004-3-26', 56566, 'Бухгалтерия'),
(33, 'Мельниченко Андрей','1982-1-9', 46893, 'Читальный зал'),
(34, 'Кузьменко Георгий','1971-9-24', 27080, 'Организация'),
(35, 'Демчук Ольга','1980-8-16', 51450, 'Читальный зал'),
(36, 'Костюк Максим','1971-5-13', 31965, 'Организация'),
(37, 'Романюк Николай','1994-7-15', 17361, 'Бухгалтерия'),
(38, 'Киричук Полина','1987-5-4', 59355, 'Бухгалтерия'),
(39, 'Мельник Елена','1974-5-23', 28964, 'Бухгалтерия'),
(40, 'Дорошенко Юлия','2000-10-26', 57046, 'Редакция');

create view average_sal_by_branch as
select branch, round(avg(salary)) as average_salary
from libwork.employees 
group by branch;

create view employees_amount as
select branch, count(id) as employee_by_branch
from employees
group by branch;

create view min_max_year as
select extract(year from min(hire_date)) as earliest_year, extract(year from max(hire_date)) as latest_year
from employees;